import { View } from '@tarojs/components'
import './index.less'

export default () => {
  return (
    <View>
      <View className='text-a color-grey-0'>用户协议</View>
      <View className='text-a color-grey-0'>(用户使用条款)</View>
      本协议为您与“百城用工”软件所有者
      (广州伍壹数智科技有限公司，以下简称“我们”、“本公司”或“百城用工平台”之间所订立的契约，具有合同的法律效力，请您仔细阅读，特别是免责条款，用户责任条款，约定争议解决方式、司法管辖、法律适用的条款
      <View className='color-grey-0'>一、定义</View>
      1、“百城用工平台”:是指广州伍壹数智科技有限公司提供的名称为“百城用工”软件，包括但不限于PC版及移动iOS版、移动Android版、Pad版等各种无线手持终端版本的“百城用工”软件，以下统一简称为“百城用工”
      2、用户:本协议中，“用户”是指通过在“百城用工注册并为商户提供客房清洁服务、餐饮服务员、厨师及其他小时工服务的实际承揽人。用户将自有技能、服务内容、服务费用标准等利用“百城用工”平台进行展示并在百城用工”平台进行承接服务、完成交易，接受“百城用工”监管以及商户的评价以及服务费用的结算等。用户依约抢单并完成订单服务的，有权通过“百城用工”平台自商户处获取相应的报酬。任何时候，用户与“百城用工”平台之间并不存在任何的劳动、劳务、雇佣关系。
      3、商户:
      是指在“百城用工”平台发布服务需求的商家。商家应当根据“百城用工”协议以及业务规则以及订单信息等，向依约完成服务订单的用户支付服务报酬。
      4、服务订单:是指商户通过“百城用工”平台发布的服务需求要约信息
      (包括但不限于商户名称、地址、服务内容、服务时间、服务地点、服务价格、服务标准、服务对接人等信息);一旦用户通过抢单的方式确定承接服务订单的，则该服务订单即时生效。用户按此服务订单完成服务的，商户需此服务订单支付报酬
      <View className='color-grey-0'>二、本协议的内容、生效、变更</View>
      1、本协议内容包括协议正文及“百城用工平台”已经发布的或将来可能发布的各类规则。所有规则为本协议不可分割的组成部分，与协议正文具有同等法律效力。
      2、在注册成为用户之前应认真阅读全部协议内容。如对协议有任何疑问，可向“百城用工”客服咨询。在同意所有协议条款并完成注册程序，才能成为本站的正式用户。请您审慎阅读并选择勾选接受或不接受本《协议》勾选后才可以进行账号的获取、使用及获得我们发布的信息。在您勾选后本协议即生效，对双方产生约束力，届时您不能以未阅读本协议的内容或者未获得我们对您问询的解答等理由，主张本协议无效，或要求撤销本协议。
      3、您承诺接受并遵守本协议的约定。如果您不同意本协议的约定，您应立即停止注册程序
      4、我们有权根据需要不定期的对本《协议》进行修改，修改后的协议条款一旦公布即代替原来的协议条款，不再另行通知。用户可重新下载安装本软件或登录网站查阅最新版协议条款。在我们修改《协议》条款后，如果用户不接受修改后的条款，可选择停止使用我们提供的软件和服务，如果用户继续使用我们提供的软件和服务，即视为您已接受了修改后的协议。
      <View className='color-grey-0'>三、注册</View>
      1、注册资格
      用户须具有法定的相应权利能力和行为能力的自然人、法人或其他组织，能够独立承担法律责任。您完成注册程序或下载“百城用工”软件的方式实际使用本平台服务时，即视为您确认自己具备主体资格，能够独立承担法律责任。若因您不具备主体资格，而导致的一切后果，由您自行承担。
      2、注册资料
      2.1、用户应诚信地向本平台提供注册资料，用户保证提供的注册资料真实、准确、完整、合法有效，个人信息如有变动的，应及时更新其个人资料并告知“百城用工”平台管理者，待管理人员重新审核后才可以使用该账号获得客源信息。如果用户提供的注册资料不合法、不真实、不准确、不详尽的，用户需承担因此引起的相应责任及后果，并且我们保留终止用户使用本平台各项服务的权利
      2.2、用户为个人的，需提供真实有效的手机号码，身份证号码等信息，对这些信息我们将予以严格保密，除非得到用户的授权或法律另有规定，本站不会向外界披露用户隐私信息，用户为企业、法人组织的，除需提供手机号码、车辆信息外，还需提供营业执照的信息，本平台仅对企业主未对外公布的信息予以保密。
      3、账户
      3.1、您注册成功后，即成为“百城用工”平台的用户，将持有“百城用工”平台的用户名和密码等账户信息，您可以根据本站规定改变您的密码。
      3.2、您设置的用户名不得侵犯或涉嫌侵犯他人合法权益，或违背公序良俗原则。否则，我们有权终止向您提供客源信息，并有权注销您的账户。
      3.3、用户完成申请注册手续后，即获得该账号的使用权。该账号使用权仅属于初始申请注册人，初始由请注册人不得赠与，借用，租用，转让或售卖该账号或者以其他方式许可非初始申请注册人使用该账号。用户承担账号、账号注册信息与密码的保管责任，并就其帐号及密码项下的一切行为承担法律责任。
      3.4、用户如果发现任何非法使用等可能危及您的账户安全的情形时，您应当立即以有效方式通知“百城用工”管理者，要求“百城用工”管理者暂停相关服务。因黑客行为、病毒等原因或因用户的保管疏忽导致账号、密码遭他人非法使用，我们不承担任何责任，但我们会尽全力配合您寻求救济途径。您理解我们对您的请求采取行动需要合理时间，我们对在采取行动前已经产生的后果(包括但不限干您的任何损失)不承担任何责任。
      4、用户信息的合理使用
      4.1、用户同意，我们有权在提供相关服务过程中通过短信、微信或邮件的形式向用户推送商品促销或其他相关商业信息。
      4.2、用户了解并同意，我们有权将用户的联系方式透露给第三方。同意在与用户通讯时会收集用户的资讯（包括但不限于位置资讯、交易资讯、使用情况和喜好、设备资讯、记录资讯）。在服务期间我们会根据需要为提供商品、业务、信息、系统集成的第三方共享用户资料，但同时要求第三方承担与我们同样的保护用户隐私的责任。
      4.3、用户同意在使用平台期问不定时提供位置信息。
      4.4、在不透露单个用户隐私资料的前提下，我们有权
      对整个用户数据库进行分析并对用户数据库进行商业上的利用。
      4.5、出现以下几种情况，不视为我们对用户个人信息的泄露： •事先获得用户的明确授权；
      •根据有关的法律法规要求； •按照相关政府主管部门的要求； •为维护社会公众的利益；
      •为维护本公司的合法权益。
      <View className='color-grey-0'>四、服务内容</View>
      1、“百城用工”提供的服务主要包括提供商户服务需求与用户需求提供之间供求关系的撮合服务，行业类别主要涉及酒店、餐饮等服务业。
      2、在“百城用工”平台提供的服务信息均需通过抢单的方式确定最终的用户。如果用户抢单后不履行或延迟履行义务的，“百城用工”平台将根据用户协议采取处罚措施，此外“百城用工”平台还有权将该用户列入黑名单，甚至做出冻结、查封或注销该用户账号，永久取消其在“百城用工”平台的交易机会。
      3、用户抢单接单成功后即表示服务的供需（服务的提供方——用户个人与服务的需求方——酒店餐饮商户）双方已经达成协议，供需双方建立合作关系，自此供需双方基于目标服务的杈利义务由供需双方自行承担。
      <View className='color-grey-0'>五、用户责任</View>
      1、用户保证所填写的信息真实、完整；若用户为企业主的，保证提供的营业执照真实无误。因用户原因导致需要承担法律责任的由用户自己承担，我们不承担此责任，若给我们造成损失的，我们有权向用户追偿。
      2、用户通过在线申请注册流程，并签订协议后，用户须在开通账号起3日内完成信息的设定工作，否则账号将会关闭，账号关闭后用户无法上传任何信息，如需开通账号还须重新提交并申请通过后方可再次开通账号。
      3、用户保证提供的服务质量符合行业标准；由于用户提供服务造成人身损害或财产损失的，用户应承担由此产生的一切后果。
      4、因用户的错误操作而造成的系统自动退款等损失，由用户自行负责。
      5、用户同意为其未及时的通知或更新其信息承担全部责任，如因此给本公司（包括其合作伙伴、代理人、职员等）造成损失的，用户同意赔偿其全部损失。
      6、用户因使用“百城用工”平台为商户提供服务而获取的收益（若有），应当自行依法缴纳相关税费。
      7、用户有义务自行购买商业保险，并自行或根据保险合同承担提供服务过程中的意外事故或责任事故的责任。
      8、用户在使用“百城用工”服务过程中，保证诚实信用，必须遵循以下原则 (1）
      遵守中国有关的法律和法规； (2） 不得为任何非法目的而使用该服务系统； (3）
      不得以任何形式使用“百城用工”服务侵犯本公司的商业利益，包括并不限于发布非经本公司许可的商业广告；
      (4）
      不得利用本平台提供的服务上传、展示或传播任何虛假的、骚扰性的、中伤他人的、辱骂性的、恐吓性的、庸俗淫秽的或其他任何非法的信息资料；
      (5） 不得侵犯其他任何第三方的专利权、著作权、商标权、名誉权或其他任何合法权益； (6）
      不得利用“百城用工”服务系统进行任何不利于我们的行为(包括但不限于窃取、外泄服务系统内的信息等；
      (7） 相关法律法规规定的其他情形。
      <View className='color-grey-0'>六、协议终止</View>
      1、您同意，我们有权自行全权决定经事先通知的中止、终止向您提供部分或全部“百城用工”平台服务，暂时冻结或永久冻结（注销）您的账户，且无须为此向您或任何第三方承担任何责任。
      2、用户出现以下任何一种情况，我们有权终止本次协议： （1）
      用户提供的个人资料及各类证件照不真实的； （2） 用户违反本《协议》中规定的使用规则； （3）
      用户不服从我们的管理的； （4）
      用户注册的免费账号昵称和姓名如存在违反法律法规或国家政策要求，或侵犯任何第三方合法杈益的情况，我们有权禁止用户继续使用该账号、昵称、姓名；
      （5）
      用户不接受我们更改后的协议内容的；但用户继续在本平台获取服务的视为接受更改后的协议，此情况除外；
      (6） 用户违反相关法律法规规定的其他情形。
      <View className='color-grey-0'>七、违约责任</View>
      1、如因我们违反有关法律、法规或本 《协议》
      项下的任何条款而给用户造成损失，我们同意承担由此造成的损害赔偿责任。
      2、用户同意保障和维护本公司及其他用户的利益，如因用户违反有关法律、法规或本《协议》
      项下的任何条款，给我们或任何第三人造成损失，用户同意承担全部的赔偿责任等法律责任。
      3、履行本协议并使用“百城用工”或其服务，您同意您应保护、赔偿并支持我们、我们的附属公司、我们的许可人、以及我们每一个和他们各自的管理人员、董事、其他用户、员工、律师和代理人，使其免受任何和所有索赔、成本、损害、损失、责任和开支（包括律师费和诉讼费）。这些费用可能由于以下原因产生或与此有关：(a)您违反或违背本协议条款或任何适用法律或法规中的任何一条规定（无论是否在此引用）；(b)您触犯任何第三方的权利，包括“百城用工”列出的承运人；或(C)您使用或误用“百城用工”或其服务。
      <View className='color-grey-0'>八、免责声明</View>
      1“百城用工”基于“现有状况”向您提供本应用程序。“百城用工”不保证该应用程序与您的移动设备相互兼容，亦不保证“百城用工”的应用程序（内容）和“百城用工”的网站没有错误、缺陷、恶意软件和病毒，或应用程序及“百城用工”的网站完全正确、最新且精确。
      2、由于互联网及移动网服务的特殊性（如计算机病毒、黑客攻击、通信线路故障、网络维护等原因），“百城用工”的服务可能随时被变更、终止或中断。由此导致的任何损害，除非此等损害由“百城用工”故意或重大疏忽直接造成，否则造成的损失由用户自行承担。
      3、用户应自行承担使用“百城用工”及其服务的风险。在适用法律允许的最大范围内，“百城用工’不负责承担任何由于（或关于）使用或无法使用“百城用工”或其服务所造成的损害
      (包括任何直接、问接、偶然造成的损害或任何利润损失或对您移动设备造成的损害）。
      <View className='color-grey-0'>九、知识产杈声明</View>
      1、“百城用工平台”是“百城用工”软件的知识产权权利人。“百城用工”软件所包含的一切著作权、版权、商标权、专利权、商业秘密等知识产权，以及相关的所有信息内容，包括但不限于：文字表述及其组合、音频、视频、图标、图饰、图表、色彩、界面设计、版面框架、有关数据、印刷材料、或电子文档等均受中华人民共和国相关法律法规和相应的国际条约保护，除涉及第三方授权的软件或技术外，“百城用工平台”享有上述知识产权。
      2、未经我们书面同意，用户不得
      （1）对服务或应用进行任何许可、授权许可、出售、转售、转让、分配、分派或以其他方式从事商业活动，亦不得以任何方式提供给任何第三方；
      （2）对服务或应用进行修改或衍生开发；
      （3）在任何其他服务器或基于无线或因特网的设备上创建因特网“链接”至服务，或“框架”或“映射”至应用程序；
      (4）进行反向工程或访问应用程序以便设计或构造一个与之相竞争的产品或服务；使用与服务或应用程序类似的理念、特性、功能、服务或图形设计来构造某产品;抄袭服务或应用程序的任何理念、特性、功能或服务或图形；运行每秒多次服务器请求或致使服务或应用产生过度负荷、影响其操作和/或性能的自动化程序或脚本，包括但不限干网络蜘蛛、网页爬虫、网络机器人、网络蚂蚁、网络索引、机器人程序、病毒、蠕虫或任何其他程序。我们保留追究上述行为法律责任的权利。
      3、在您遵守这些条款的前提下，我们授予您有限的、非排他的、不可转让的许可，以便您能下载一份应用程序并安装在您的移动设备上，并仅出于您自用目的运行该应用程序。
      4、您使用“百城用工”的行为并不赋予您任何有关“百城用工”知识产权的权利
      （包括但不限于版权、商标、标志、图形、图片、动画、视频和文本或在应用程序和应用中的权利），或有关“百城用工”零售或广告合作伙伴的知识产权的权利，但您依照本条款使用和接收服务的不可转让的个人权利除外。
      <View className='color-grey-0'>十、法律适用、管辖</View>
      1、本协议的订立、成立、生效、履行、解释及争议的解决均应适用中华人民共和国大陆地区的法律并受中国有管辖权的法院管辖。
      2、与本协议有关的或由本协议引起的任何争议，双方应尽量友好协商解决；协商不成时，任何一方均可向“百城用工平台”公司所在地的人民法院提起诉讼。
      <View className='color-grey-0'>十一、其他规定</View>
      1、双方对本协议之约定事项及其他有关事宜为完整协议，除本协议规定的之外，未赋予本协议各方其他权利。
      2、如本协议中的任何条款无论因何种原因完全或部分无效或不具有执行力，本协议的其余条款仍应有效并且有约束力。
      3、本协议的所有标题仅仅是为了醒目及阅读方便，本身并无实际涵义，不能作为本协议涵义解释之依据。
      4、如果没有“百城用工”的事先书面同意，您不得向任何人员分派或转让任何您在本协议下的权利或义务。
      5、“百城用工”可以通过在“百城用工”平台上发布一般通知，或通过向您电子邮件地址(记录在我们帐户信息中中的）发送电子邮件，或通过向您登记于我们帐户信息中的地址
      （平邮书面函电的方式）进行通知。
    </View>
  )
}
